[
    {
      "title": "ReShare",
      "description": " A project designed and build during Technigo's upskill course in javaScript and React. The ReShare is a mission aligned with Agenda 2030 - Addressing siciatal challanges through innovative solutions.It was a collaborative front end project which was completed in three weeks and we applied all the knowledge we learned during the course. designed and built a fullstack app in three weeks, applying everything we had learned during the course. We followed an agile process, collaborated on GitHub, and regularly demoed our progress.",
      "techStacks":["React","javascript","mongodb","CSS","Postman","API's"],
      "link": "https://stirring-florentine-c4bb3f.netlify.app/"
    },
    {
      "title": "ToDo App",
      "description": "Developed as part of a team project with the goal of learning React and Redux. The application allows users to create and manage goal-oriented projects with nested tasks, as well as standalone individual tasks. Focus was on state management, task hierarchy, and user-friendly interaction.",
      "techStacks":["React","javascript","Redux","CSS"],
      "link": "https://filzas-todo-app.netlify.app/"
    },
    {
      "title": "Quiz App ",
      "description": "A fun and educational quiz game built with React and Redux, designed to test users’ knowledge about Sweden. Players earn 2 points for correct answers and lose 1 point for wrong or unanswered ones. Features include a countdown timer, real-time feedback, and a final score summary. The app emphasizes clean UI and responsive user experience.",
      "techStacks":["React","Redux","javascript"],
      "link": "https://funn-quizz.netlify.app/"
    },
    {
        "title": "Pupular Movies",
        "description": "Utilizing themoviedb.org's API to showcase movies and their details. Features include fetching popular movies, rendering movie details, and managing image URLs. Designed with a focus on responsiveness and accessibility. Enhancements include error handling, loading states, and dynamic movie lists.",
        "techStacks":["React","javascript","CSS","Postman","API's"],
        "link": "https://filzas-movies-project.netlify.app/"
      },
      {
        "title": "Happy Thoughts",
        "description": "A React frontend project focused on state management and API interactions for fetching and posting data in a feed.",
        "link": "https://filzas-happy-thoughts-project.netlify.app/"
      }
  ]
  